## Plan Result (sandbox_enterprise - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 192 to add, 6 to change, 107 to destroy.</code></pre>

* Create
  * module.custom_role_assignments[&#34;DCD-RBAC-CONTROL&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DTS-RBAC-PROD&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DTS-RBAC-PRODUCTION&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DTS-RBAC-SANDBOX&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azuread_application.app
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azuread_group_member.dts_operation_members
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azuread_group_member.members[&#34;Reader-0&#34;]
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azuread_service_principal.sp
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azurerm_role_assignment.local_groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azurerm_role_assignment.local_groups[&#34;Owner&#34;]
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azurerm_role_assignment.local_groups[&#34;Reader&#34;]
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azurerm_role_assignment.local_groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azurerm_role_assignment.local_role_assignments[&#34;Monitoring Contributor&#34;]
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azurerm_role_assignment.local_role_assignments[&#34;Network Contributor&#34;]
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].azurerm_subscription.this
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DCD-RBAC-CONTROL&#34;].time_rotating.rotation_period
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azuread_application.app
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azuread_group_member.dts_operation_members
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azuread_group_member.members[&#34;Reader-0&#34;]
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azuread_service_principal.sp
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azurerm_role_assignment.local_role_assignments[&#34;Monitoring Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azurerm_role_assignment.local_role_assignments[&#34;Network Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].azurerm_subscription.this
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-RBAC-PROD&#34;].time_rotating.rotation_period
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azuread_application.app
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azuread_group_member.dts_operation_members
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azuread_group_member.members[&#34;Reader-0&#34;]
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azuread_service_principal.sp
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azurerm_role_assignment.local_groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azurerm_role_assignment.local_groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azurerm_role_assignment.local_groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azurerm_role_assignment.local_groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azurerm_role_assignment.local_role_assignments[&#34;Monitoring Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azurerm_role_assignment.local_role_assignments[&#34;Network Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].azurerm_subscription.this
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-RBAC-PRODUCTION&#34;].time_rotating.rotation_period
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azuread_application.app
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azuread_group_member.dts_operation_members
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azuread_group_member.members[&#34;Reader-0&#34;]
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azuread_service_principal.sp
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azurerm_role_assignment.local_groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azurerm_role_assignment.local_groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azurerm_role_assignment.local_groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azurerm_role_assignment.local_groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Monitoring Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Network Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].azurerm_subscription.this
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-RBAC-SANDBOX&#34;].time_rotating.rotation_period
* Update
  * module.enterprise.azurerm_management_group.level_3[&#34;CFT-Prod&#34;]
  * module.enterprise.azurerm_management_group.level_3[&#34;CFT-Sandbox&#34;]
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_storage_account.sa
* Delete
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuread_application.app
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuread_group_member.dts_operation_members
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuread_group_member.members[&#34;Reader-0&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuread_service_principal.sp
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].time_rotating.rotation_period
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_application.acme_appreg[0]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_application.app
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_group_member.dts_operation_members
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_group_member.members[&#34;Reader-0&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_service_principal.sp
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].random_uuid.acme_app_uuid[0]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].time_rotating.rotation_period
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuread_application.app
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuread_group_member.dts_operation_members
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuread_group_member.members[&#34;Reader-0&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuread_service_principal.sp
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].time_rotating.rotation_period




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.custom_role_assignments["DCD-RBAC-CONTROL"].azurerm_role_assignment.custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = (known after apply)
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.custom_role_assignments["DTS-RBAC-PROD"].azurerm_role_assignment.custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = (known after apply)
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.custom_role_assignments["DTS-RBAC-PRODUCTION"].azurerm_role_assignment.custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = (known after apply)
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.custom_role_assignments["DTS-RBAC-SANDBOX"].azurerm_role_assignment.custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = (known after apply)
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.azurerm_management_group.level_3["CFT-Prod"] will be updated in-place
  ~ resource "azurerm_management_group" "level_3" {
        id                         = "/providers/Microsoft.Management/managementGroups/CFT-Prod"
        name                       = "CFT-Prod"
      ~ subscription_ids           = [] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.enterprise.azurerm_management_group.level_3["CFT-Sandbox"] will be updated in-place
  ~ resource "azurerm_management_group" "level_3" {
        id                         = "/providers/Microsoft.Management/managementGroups/CFT-Sandbox"
        name                       = "CFT-Sandbox"
      ~ subscription_ids           = [] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.subscription["DCD-RBAC-CONTROL"].azuread_application.app will be created
  + resource "azuread_application" "app" {
      + app_role_ids                = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "DTS Bootstrap (sub:dcd-rbac-control)"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + notes                       = "This service principal created by hmcts/azure-enterprise repository"
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + api {
          + requested_access_token_version = 1

          + oauth2_permission_scope {
              + admin_consent_description  = "Allow the application to access DTS Bootstrap (sub:dcd-rbac-control) on behalf of the signed-in user."
              + admin_consent_display_name = "Access DTS Bootstrap (sub:dcd-rbac-control)"
              + enabled                    = true
              + id                         = (known after apply)
              + type                       = "User"
              + user_consent_description   = "Allow the application to access DTS Bootstrap (sub:dcd-rbac-control) on your behalf."
              + user_consent_display_name  = "Access DTS Bootstrap (sub:dcd-rbac-control)"
              + value                      = "user_impersonation"
            }
        }

      + required_resource_access {
          + resource_app_id = "00000003-0000-0000-c000-000000000000"

          + resource_access {
              + id   = "06da0dbc-49e2-44d2-8312-53f166ab848a"
              + type = "Scope"
            }
          + resource_access {
              + id   = "5b567255-7703-4780-807c-7be8301ae99b"
              + type = "Role"
            }
          + resource_access {
              + id   = "9a5d68dd-52b0-4cc2-bd40-abcf44ac3a30"
              + type = "Role"
            }
        }

      + web {
          + homepage_url = "https://dev.azure.com/hmcts/PlatformOperations"

          + implicit_grant {
              + access_token_issuance_enabled = false
              + id_token_issuance_enabled     = true
            }
        }
    }

  # module.subscription["DCD-RBAC-CONTROL"].azuread_application_password.token will be created
  + resource "azuread_application_password" "token" {
      + application_id      = (known after apply)
      + display_name        = (known after apply)
      + end_date            = (known after apply)
      + id                  = (known after apply)
      + key_id              = (known after apply)
      + rotate_when_changed = (known after apply)
      + start_date          = (known after apply)
      + value               = (sensitive value)
    }

  # module.subscription["DCD-RBAC-CONTROL"].azuread_group.groups["Azure Kubernetes Service Cluster Admin Role"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants aks cluster admin permissions to the DCD-RBAC-CONTROL subscription"
      + display_name                   = "DTS AKS Administrators (sub:dcd-rbac-control)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.subscription["DCD-RBAC-CONTROL"].azuread_group.groups["Azure Kubernetes Service Cluster User Role"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants aks cluster user permissions to the DCD-RBAC-CONTROL subscription"
      + display_name                   = "DTS AKS Users (sub:dcd-rbac-control)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.subscription["DCD-RBAC-CONTROL"].azuread_group.groups["Contributor"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants contributor permissions to the DCD-RBAC-CONTROL subscription"
      + display_name                   = "DTS Contributors (sub:dcd-rbac-control)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.subscription["DCD-RBAC-CONTROL"].azuread_group.groups["Key Vault Administrator"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants key vault administrator permissions to the DCD-RBAC-CONTROL subscription"
      + display_name                   = "DTS Key Vault Administrators (sub:dcd-rbac-control)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.subscription["DCD-RBAC-CONTROL"].azuread_group.groups["Owner"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants owner permissions to the DCD-RBAC-CONTROL subscription"
      + display_name                   = "DTS Owners (sub:dcd-rbac-control)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.subscription["DCD-RBAC-CONTROL"].azuread_group.groups["Reader"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants reader permissions to the DCD-RBAC-CONTROL subscription"
      + display_name                   = "DTS Readers (sub:dcd-rbac-control)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.subscription["DCD-RBAC-CONTROL"].azuread_group.groups["Security Reader"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants security reader permissions to the DCD-RBAC-CONTROL subscription"
      + display_name                   = "DTS Security Readers (sub:dcd-rbac-control)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.subscription["DCD-RBAC-CONTROL"].azuread_group.groups["Storage Blob Data Reader"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants storage blob data contributor permissions to the DCD-RBAC-CONTROL subscription"
      + display_name                   = "DTS Blob Readers (sub:dcd-rbac-control)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled      

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

ull
      - id                      = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-prod-rg/providers/Microsoft.KeyVault/vaults/cbb9ca405cdfab539e8b3kv/objectId/a40b6da3-67b9-4301-9d2f-5dd460bbbd22" -> null
      - key_permissions         = [
          - "Backup",
          - "Create",
          - "Decrypt",
          - "Delete",
          - "Encrypt",
          - "Get",
          - "Import",
          - "List",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
        ] -> null
      - key_vault_id            = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-prod-rg/providers/Microsoft.KeyVault/vaults/cbb9ca405cdfab539e8b3kv" -> null
      - object_id               = "a40b6da3-67b9-4301-9d2f-5dd460bbbd22" -> null
      - secret_permissions      = [
          - "Get",
          - "Set",
          - "List",
          - "Delete",
          - "Restore",
          - "Recover",
          - "Backup",
        ] -> null
      - storage_permissions     = [
          - "Backup",
          - "Delete",
          - "DeleteSAS",
          - "Get",
          - "GetSAS",
          - "List",
          - "ListSAS",
          - "Recover",
          - "RegenerateKey",
          - "Restore",
          - "Set",
          - "SetSAS",
          - "Update",
        ] -> null
      - tenant_id               = "e575f663-b30a-4786-89ad-319842dfe853" -> null
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_key_vault_secret.aks_admin_group_id will be destroyed
  # (because module.subscription["DTS-Terraform-Prod-Test1"] is not in configuration)
  - resource "azurerm_key_vault_secret" "aks_admin_group_id" {
      - id                      = "https://cbb9ca405cdfab539e8b3kv.vault.azure.net/secrets/aks-admin-rbac-group-id/92e8e602db3840149889c7f68eda386c" -> null
      - key_vault_id            = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-prod-rg/providers/Microsoft.KeyVault/vaults/cbb9ca405cdfab539e8b3kv" -> null
      - name                    = "aks-admin-rbac-group-id" -> null
      - resource_id             = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-prod-rg/providers/Microsoft.KeyVault/vaults/cbb9ca405cdfab539e8b3kv/secrets/aks-admin-rbac-group-id/versions/92e8e602db3840149889c7f68eda386c" -> null
      - resource_versionless_id = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-prod-rg/providers/Microsoft.KeyVault/vaults/cbb9ca405cdfab539e8b3kv/secrets/aks-admin-rbac-group-id" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "92e8e602db3840149889c7f68eda386c" -> null
      - versionless_id          = "https://cbb9ca405cdfab539e8b3kv.vault.azure.net/secrets/aks-admin-rbac-group-id" -> null
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_key_vault_secret.aks_user_group_id will be destroyed
  # (because module.subscription["DTS-Terraform-Prod-Test1"] is not in configuration)
  - resource "azurerm_key_vault_secret" "aks_user_group_id" {
      - id                      = "https://cbb9ca405cdfab539e8b3kv.vault.azure.net/secrets/aks-user-rbac-group-id/b18c894181204d8399ff1ea250490f61" -> null
      - key_vault_id            = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-prod-rg/providers/Microsoft.KeyVault/vaults/cbb9ca405cdfab539e8b3kv" -> null
      - name                    = "aks-user-rbac-group-id" -> null
      - resource_id             = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-prod-rg/providers/Microsoft.KeyVault/vaults/cbb9ca405cdfab539e8b3kv/secrets/aks-user-rbac-group-id/versions/b18c894181204d8399ff1ea250490f61" -> null
      - resource_versionless_id = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-prod-rg/providers/Microsoft.KeyVault/vaults/cbb9ca405cdfab539e8b3kv/secrets/aks-user-rbac-group-id" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "b18c894181204d8399ff1ea250490f61" -> null
      - versionless_id          = "https://cbb9ca405cdfab539e8b3kv.vault.azure.net/secrets/aks-user-rbac-group-id" -> null
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_key_vault_secret.sp_app_id will be destroyed
  # (because module.subscription["DTS-Terraform-Prod-Test1"] is not in configuration)
  - resource "azurerm_key_vault_secret" "sp_app_id" {
      - id                      = "https://cbb9ca405cdfab539e8b3kv.vault.azure.net/secrets/sp-application-id/b36dd13e1a7d4852876cab5d59815683" -> null
      - key_vault_id            = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-prod-rg/providers/Microsoft.KeyVault/vaults/cbb9ca405cdfab539e8b3kv" -> null
      - name                    = "sp-application-id" -> null
      - resource_id             = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-prod-rg/providers/Microsoft.KeyVault/vaults/cbb9ca405cdfab539e8b3kv/secrets/sp-application-id/versions/b36dd13e1a7d4852876cab5d59815683" -> null
      - resource_versionless_id = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-prod-rg/providers/Microsoft.KeyVault/vaults/cbb9ca405cdfab539e8b3kv/secrets/sp-application-id" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "b36dd13e1a7d4852876cab5d59815683" -> null
      - versionless_id          = "https://cbb9ca405cdfab539e8b3kv.vault.azure.net/secrets/sp-application-id" -> null
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_key_vault_secret.sp_object_id will be destroyed
  # (because module.subscription["DTS-Terraform-Prod-Test1"] is not in configuration)
  - resource "azurerm_key_vault_secret" "sp_object_id" {
      - id                      = "https://cbb9ca405cdfab539e8b3kv.vault.azure.net/secrets/sp-object-id/ee3e4655e1434900bd48f4329310c276" -> null
      - key_vault_id            = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-prod-rg/providers/Microsoft.KeyVault/vaults/cbb9ca405cdfab539e8b3kv" -> null
      - name                    = "sp-object-id" -> null
      - resource_id             = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-prod-rg/providers/Microsoft.KeyVault/vaults/cbb9ca405cdfab539e8b3kv/secrets/sp-object-id/versions/ee3e4655e1434900bd48f4329310c276" -> null
      - resource_versionless_id = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-prod-rg/providers/Microsoft.KeyVault/vaults/cbb9ca405cdfab539e8b3kv/secrets/sp-object-id" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "ee3e4655e1434900bd48f4329310c276" -> null
      - versionless_id          = "https://cbb9ca405cdfab539e8b3kv.vault.azure.net/secrets/sp-object-id" -> null
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_key_vault_secret.sp_token will be destroyed
  # (because module.subscription["DTS-Terraform-Prod-Test1"] is not in configuration)
  - resource "azurerm_key_vault_secret" "sp_token" {
      - id                      = "https://cbb9ca405cdfab539e8b3kv.vault.azure.net/secrets/sp-token/8545ebf059e94b58a693fb4236e79489" -> null
      - key_vault_id            = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-prod-rg/providers/Microsoft.KeyVault/vaults/cbb9ca405cdfab539e8b3kv" -> null
      - name                    = "sp-token" -> null
      - resource_id             = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-prod-rg/providers/Microsoft.KeyVault/vaults/cbb9ca405cdfab539e8b3kv/secrets/sp-token/versions/8545ebf059e94b58a693fb4236e79489" -> null
      - resource_versionless_id = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-prod-rg/providers/Microsoft.KeyVault/vaults/cbb9ca405cdfab539e8b3kv/secrets/sp-token" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "8545ebf059e94b58a693fb4236e79489" -> null
      - versionless_id          = "https://cbb9ca405cdfab539e8b3kv.vault.azure.net/secrets/sp-token" -> null
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_role_assignment.local_role_assignments["Key Vault Contributor"] will be destroyed
  # (because module.subscription["DTS-Terraform-Prod-Test1"] is not in configuration)
  - resource "azurerm_role_assignment" "local_role_assignments" {
      - id                   = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-prod-rg/providers/Microsoft.KeyVault/vaults/cbb9ca405cdfab539e8b3kv/providers/Microsoft.Authorization/roleAssignments/ebe53bad-9529-4e5a-91d0-28b2c8f7efba" -> null
      - name                 = "ebe53bad-9529-4e5a-91d0-28b2c8f7efba" -> null
      - principal_id         = "a40b6da3-67b9-4301-9d2f-5dd460bbbd22" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/providers/Microsoft.Authorization/roleDefinitions/f25e0fa2-a7c8-4377-a976-54943a77a395" -> null
      - role_definition_name = "Key Vault Contributor" -> null
      - scope                = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-prod-rg/providers/Microsoft.KeyVault/vaults/cbb9ca405cdfab539e8b3kv" -> null
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_role_assignment.local_role_assignments["Storage Account Contributor"] will be destroyed
  # (because module.subscription["DTS-Terraform-Prod-Test1"] is not in configuration)
  - resource "azurerm_role_assignment" "local_role_assignments" {
      - id                   = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-prod-rg/providers/Microsoft.Storage/storageAccounts/cbb9ca405cdfab539e8b3sa/providers/Microsoft.Authorization/roleAssignments/50c1ef59-ec21-875f-1356-e4860bb53ec0" -> null
      - name                 = "50c1ef59-ec21-875f-1356-e4860bb53ec0" -> null
      - principal_id         = "a40b6da3-67b9-4301-9d2f-5dd460bbbd22" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/providers/Microsoft.Authorization/roleDefinitions/17d1049b-9a84-46fb-8f53-869881c3d3ab" -> null
      - role_definition_name = "Storage Account Contributor" -> null
      - scope                = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-prod-rg/providers/Microsoft.Storage/storageAccounts/cbb9ca405cdfab539e8b3sa" -> null
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_role_assignment.local_role_assignments["Storage Blob Data Contributor"] will be destroyed
  # (because module.subscription["DTS-Terraform-Prod-Test1"] is not in configuration)
  - resource "azurerm_role_assignment" "local_role_assignments" {
      - id                   = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-prod-rg/providers/Microsoft.Storage/storageAccounts/cbb9ca405cdfab539e8b3sa/providers/Microsoft.Authorization/roleAssignments/d0465c4d-fca8-01ad-c5f9-f6d896902f8b" -> null
      - name                 = "d0465c4d-fca8-01ad-c5f9-f6d896902f8b" -> null
      - principal_id         = "a40b6da3-67b9-4301-9d2f-5dd460bbbd22" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> null
      - role_definition_name = "Storage Blob Data Contributor" -> null
      - scope                = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-prod-rg/providers/Microsoft.Storage/storageAccounts/cbb9ca405cdfab539e8b3sa" -> null
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_storage_account.sa will be destroyed
  # (because module.subscription["DTS-Terraform-Prod-Test1"] is not in configuration)
  - resource "azurerm_storage_account" "sa" {
      - access_tier                       = "Hot" -> null
      - account_kind                      = "StorageV2" -> null
      - account_replication_type          = "ZRS" -> null
      - account_tier                      = "Standard" -> null
      - allow_nested_items_to_be_public   = false -> null
      - cross_tenant_replication_enabled  = true -> null
      - default_to_oauth_authentication   = false -> null
      - dns_endpoint_type                 = "Standard" -> null
      - enable_https_traffic_only         = true -> null
      - https_traffic_only_enabled        = true -> null
      - id                                = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-prod-rg/providers/Microsoft.Storage/storageAccounts/cbb9ca405cdfab539e8b3sa" -> null
      - infrastructure_encryption_enabled = false -> null
      - is_hns_enabled                    = false -> null
      - large_file_share_enabled          = false -> null
      - local_user_enabled                = true -> null
      - location                          = "uksouth" -> null
      - min_tls_version                   = "TLS1_2" -> null
      - name                              = "cbb9ca405cdfab539e8b3sa" -> null
      - nfsv3_enabled                     = false -> null
      - primary_access_key                = (sensitive value) -> null
      - primary_blob_connection_string    = (sensitive value) -> null
      - primary_blob_endpoint             = "https://cbb9ca405cdfab539e8b3sa.blob.core.windows.net/" -> null
      - primary_blob_host                 = "cbb9ca405cdfab539e8b3sa.blob.core.windows.net" -> null
      - primary_connection_string         = (sensitive value) -> null
      - primary_dfs_endpoint              = "https://cbb9ca405cdfab539e8b3sa.dfs.core.windows.net/" -> null
      - primary_dfs_host                  = "cbb9ca405cdfab539e8b3sa.dfs.core.windows.net" -> null
      - primary_file_endpoint             = "https://cbb9ca405cdfab539e8b3sa.file.core.windows.net/" -> null
      - primary_file_host                 = "cbb9ca405cdfab539e8b3sa.file.core.windows.net" -> null
      - primary_location                  = "uksouth" -> null
      - primary_queue_endpoint            = "https://cbb9ca405cdfab539e8b3sa.queue.core.windows.net/" -> null
      - primary_queue_host                = "cbb9ca405cdfab539e8b3sa.queue.core.windows.net" -> null
      - primary_table_endpoint            = "https://cbb9ca405cdfab539e8b3sa.table.core.windows.net/" -> null
      - primary_table_host                = "cbb9ca405cdfab539e8b3sa.table.core.windows.net" -> null
      - primary_web_endpoint              = "https://cbb9ca405cdfab539e8b3sa.z33.web.core.windows.net/" -> null
      - primary_web_host                  = "cbb9ca405cdfab539e8b3sa.z33.web.core.windows.net" -> null
      - public_network_access_enabled     = true -> null
      - queue_encryption_key_type         = "Service" -> null
      - resource_group_name               = "azure-control-prod-rg" -> null
      - secondary_access_key              = (sensitive value) -> null
      - secondary_connection_string       = (sensitive value) -> null
      - sftp_enabled                      = false -> null
      - shared_access_key_enabled         = true -> null
      - table_encryption_key_type         = "Service" -> null
      - tags                              = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-enterprise"
          - "businessArea" = "CFT"
          - "criticality"  = "High"
          - "environment"  = "production"
          - "startupMode"  = "always"
        } -> null

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = true -> null

          - delete_retention_policy {
              - days                     = 30 -> null
              - permanent_delete_enabled = false -> null
            }
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_storage_container.sc will be destroyed
  # (because module.subscription["DTS-Terraform-Prod-Test1"] is not in configuration)
  - resource "azurerm_storage_container" "sc" {
      - container_access_type             = "private" -> null
      - default_encryption_scope          = "$account-encryption-key" -> null
      - encryption_scope_override_enabled = true -> null
      - has_immutability_policy           = false -> null
      - has_legal_hold                    = false -> null
      - id                                = "https://cbb9ca405cdfab539e8b3sa.blob.core.windows.net/subscription-tfstate" -> null
      - metadata                          = {} -> null
      - name                              = "subscription-tfstate" -> null
      - resource_manager_id               = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-prod-rg/providers/Microsoft.Storage/storageAccounts/cbb9ca405cdfab539e8b3sa/blobServices/default/containers/subscription-tfstate" -> null
      - storage_account_name              = "cbb9ca405cdfab539e8b3sa" -> null
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].random_uuid.app_uuid will be destroyed
  # (because module.subscription["DTS-Terraform-Prod-Test1"] is not in configuration)
  - resource "random_uuid" "app_uuid" {
      - id     = "4b165f18-0a61-9d10-5242-ba76c9e63b83" -> null
      - result = "4b165f18-0a61-9d10-5242-ba76c9e63b83" -> null
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].time_rotating.rotation_period will be destroyed
  # (because module.subscription["DTS-Terraform-Prod-Test1"] is not in configuration)
  - resource "time_rotating" "rotation_period" {
      - day              = 7 -> null
      - hour             = 7 -> null
      - id               = "2025-02-06T07:05:05Z" -> null
      - minute           = 5 -> null
      - month            = 5 -> null
      - rfc3339          = "2025-02-06T07:05:05Z" -> null
      - rotation_days    = 90 -> null
      - rotation_rfc3339 = "2025-05-07T07:05:05Z" -> null
      - second           = 5 -> null
      - unix             = 1746601505 -> null
      - year             = 2025 -> null
    }

Plan: 192 to add, 6 to change, 107 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":123,"Program":"tfcmt","SHA1":"","Target":"sandbox_enterprise - TerraformPlanApply","Vars":{}} -->